# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
#
# *Пример:*
#
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8 \


a = int(input("Введите первое число: "))
b = int(input("Введи второе число: "))



def degree(a, b):
    if b == 0:
        return 1
    a *= degree(a, b-1)
    return a

print(degree(a,b))



# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
#
# *Пример:*
#
# 2 2
#     4

a = int(input("Введи число а: "))
b = int(input("Введи число b: "))

def sum(a, b):
    if b == 1:
        return 1
    a += 1+sum(0, b-1)
    return a
print(sum(a, b))